{
Íà âõîä ïğîãğàììû ïîäàşòñÿ öåëûå ÷èñëà, èõ êîëè÷åñòâî ìîæåò áûòü 10000,
ââîä çàêàí÷èâàåòñÿ ÷èñëîì 0.
Íåîáõîäèìî íàïèñàòü ïğîãğàììó, êîòîğàÿ ñ÷èòàåò êîëè÷åñòâî òàêèõ ïàğ ÷èñåë,
ñóììà êîòîğûõ :
1) ÷¸òíà;
2) ëåæèò ìåæäó ÷èñëàìè 100 è 200.
Êàê ğåçóëüòàò äîëæíà áûòü âûâåäåíà ñòğîêà, íàïğèìåğ :

Êîëè÷åñòâî èñêîìûõ ïàğ = 17
}
Program Z25ege021;
var
  n, s, x1, x2 : integer;
begin
  n:=0;
  write('Ââåäèòå ïåğâîå ÷èñëî=');readln(x1);
  s:=0;
  repeat
     write('Ââåäèòå ñëåäóşùåå ÷èñëî=');readln(x2);
     s:=x1+x2;
     if (s mod 2=0)and(s>100)and(s<200)then n:=n+1;
     x1:=x2
  until x2=0;
  if n=0 then writeln('Èñêîìûå ïàğû íå íàéäåíû!')
         else writeln('Êîëè÷åñòâî èñêîìûõ ïàğ =',n)
end.